---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetNumberOfRisers
source: html/e2cc6f2c-2bdf-a9a8-156c-52447174ab23.htm
---
# Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetNumberOfRisers Method

Gets the number of risers.

## Syntax (C#)
```csharp
public IList<int> GetNumberOfRisers()
```

## Returns
The list of numbers of risers.